# Python Basics Class Prepa

## Yahia Chammami

In [85]:
import sys
import keyword
import operator 
from datetime import datetime
import os

### Keywords
Keywords are the reserved words in Python and can't be used as an identifier

In [86]:
print(keyword.kwlist) # List all Python Keywords

['False', 'None', 'True', 'and', 'as', 'assert', 'async', 'await', 'break', 'class', 'continue', 'def', 'del', 'elif', 'else', 'except', 'finally', 'for', 'from', 'global', 'if', 'import', 'in', 'is', 'lambda', 'nonlocal', 'not', 'or', 'pass', 'raise', 'return', 'try', 'while', 'with', 'yield']

In [87]:
len(keyword.kwlist) # Python contains 35 keywords

35

In [88]:
score = 75

if score >= 90:
    print("You got an A.")
elif score >= 80:
    print("You got a B.")
elif score >= 70:
    print("You got a C.")
else:
    print("You got a D. You need to improve.")

You got a C.

In [89]:
count = 0

while count < 5:
    print("Count:", count)
    count += 1

Count: 0
Count: 1
Count: 2
Count: 3
Count: 4

In [90]:
fruits = ["apple", "banana", "cherry"]
for fruit in fruits:
    print(fruit)

apple
banana
cherry

In [91]:
def add(a, b):
    """This function adds two numbers and returns the result."""
    result = a + b
    return result
sum = add(3, 5)
print(sum)  # This will print 8

8

In [92]:
def greet(name):
    """This function greets the person passed in as a parameter."""
    print(f"Hello, {name}!")
greet("Alice")

Hello, Alice!

### Data Types

#### Numeric

In [93]:
val1=10 # Integer data type

print(type(val1))# type of object

print(val1," is Integer?",isinstance(val1,int)) # val1 is an instance of int or not

<class 'int'>
10  is Integer? True

In [94]:
val2 = 92.78 # Float data type

print(type(val2)) # type of object

print(val2," is float?",isinstance(val2,float)) # Val2 is an instance of float or not

<class 'float'>
92.78  is float? True

#### Boolean
Boolean data type can have only two possible values **true** or **false**

In [95]:
bool1= True
bool2= False

In [96]:
print(type(bool1))
print(type(bool2))

<class 'bool'>
<class 'bool'>

In [97]:
isinstance(bool1,bool)

True

#### Strings
##### String Creation

In [98]:
str1 = "***** HELLO EMLC MEMBERS"
print(str1)

***** HELLO EMLC MEMBERS

##### String Indexing

In [99]:
str1

'***** HELLO EMLC MEMBERS'

In [100]:
str1[0] # First character in string "str1"

'*'

In [101]:
str1[len(str1)-1] # Last character in string using len function

'S'

In [102]:
str1[-1] # Last character in string

'S'

In [103]:
str1[6] #Fetch 7th element of the string

'H'

In [104]:
str1[0:5] #Fetch all characters from 0 to 5 index location

'*****'

In [105]:
str1[6:12] #Fetch all characters from 6 to 12 index location

'HELLO '

##### String concatenation

In [106]:
# String concatenation
s1="Machine Learning"
s2="Club"
s3=s1+ " " +s2
print(s3)

Machine Learning Club

##### Iterating through a String

In [107]:
mystr1= "Hello Everyone"

In [108]:
# Iteration
for i in mystr1:
    print(i)

H
e
l
l
o

E
v
e
r
y
o
n
e

##### String Functions

In [109]:
mystr2 = "*********Hello Everyone***********All the Best**********"
mystr2

'*********Hello Everyone***********All the Best**********'

In [110]:
mystr2.strip('*') # Removes all '*' characters from begining & end of the string

'Hello Everyone***********All the Best'

In [111]:
mystr2.rstrip('*') # Removes all '*' characters at the end of the string

'*********Hello Everyone***********All the Best'

In [112]:
mystr2.lstrip('*') # Removes all '*' characters at the begining of the string

'Hello Everyone***********All the Best**********'

In [113]:
mystr2 = " Hello Everyone "

In [114]:
mystr2.lower() # Return whole string in lowercase

' hello everyone '

In [115]:
mystr2.upper() # Return whole string in uppercase

' HELLO EVERYONE '

In [116]:
mystr2.replace("He","Ho") #Replace substring "He" with "Ho"

' Hollo Everyone '

In [117]:
mystr2.replace(" ","") # Remove all whitespaces using replace function

'HelloEveryone'

In [118]:
mystr5 = "one two Three one two two three"

In [119]:
mystr5.count("one") # Number of times substring "one" occurred in string

2

In [120]:
mystr6='123456789'
print(mystr6.isalpha()) # returns True if all the characters in the text are lettre
print(mystr6.isdecimal()) # returns True if all the characters are decimals (0-9)
print(mystr6.isnumeric()) # returns True if all the characters are numeric (0-9)

False
True
True

### List
1) List is an ordered sequence of items.
2) We can have different data types under a list. E.g we can have integer, float and string items ina same list.

In [121]:
# Creating a list
my_list = [1, 2, 3, 4, 5]

# Accessing elements
print(my_list[0])  # Output: 1
sublist = my_list[1:4]  # Get elements at index 1, 2, and 3

# Modifying lists
my_list.append(6)
my_list.insert(2, 7)
my_list.remove(3)
del my_list[0]

# List functions
length = len(my_list)
my_list.sort()
my_list.reverse()
new_list = my_list.copy()
if 5 in my_list:
    print("5 is in the list")

# List concatenation
list1 = [1, 2, 3]
list2 = [4, 5, 6]
combined_list = list1 + list2

# Counting occurrences
count = my_list.count(2)

# Finding the index
index = my_list.index(4)

# Extending a list
my_list.extend([7, 8, 9])

# Pop and return
last_element = my_list.pop()
element = my_list.pop(2)

# List comprehensions
squares = [x**2 for x in my_list]
even_numbers = [x for x in my_list if x % 2 == 0]

# Clearing a list
my_list.clear()

# Printing the results
print("Combined List:", combined_list)
print("Count of 2:", count)
print("Index of 4:", index)
print("Squares:", squares)
print("Even Numbers:", even_numbers)
print("Cleared List:", my_list)

1
5 is in the list
Combined List: [1, 2, 3, 4, 5, 6]
Count of 2: 1
Index of 4: 3
Squares: [49, 36, 16, 4, 49, 64]
Even Numbers: [6, 4, 2, 8]
Cleared List: []

## Tupple

In [122]:
# Creating a tuple
my_tuple = (1, 2, 3, 4, 5)

# Accessing elements
print(my_tuple[0])  # Output: 1
subtuple = my_tuple[1:4]  # Get elements at index 1, 2, and 3

# Tuple functions
length = len(my_tuple)
count = my_tuple.count(2)
index = my_tuple.index(4)

# Tuple concatenation
tuple1 = (1, 2, 3)
tuple2 = (4, 5, 6)
combined_tuple = tuple1 + tuple2

# Tuple unpacking
a, b, c, d, e = my_tuple

# Checking if an element exists in a tuple
if 5 in my_tuple:
    print("5 is in the tuple")

# Nested tuples
nested_tuple = ((1, 2), (3, 4), (5, 6))

# Converting a list to a tuple
my_list = [1, 2, 3]
my_tuple_from_list = tuple(my_list)

# Printing the results
print("Combined Tuple:", combined_tuple)
print("Length of Tuple:", length)
print("Count of 2:", count)
print("Index of 4:", index)
print("Unpacked Tuple:", a, b, c, d, e)
print("Nested Tuple:", nested_tuple)
print("Tuple from List:", my_tuple_from_list)

1
5 is in the tuple
Combined Tuple: (1, 2, 3, 4, 5, 6)
Length of Tuple: 5
Count of 2: 1
Index of 4: 3
Unpacked Tuple: 1 2 3 4 5
Nested Tuple: ((1, 2), (3, 4), (5, 6))
Tuple from List: (1, 2, 3)

In [123]:
# Creating a dictionary
my_dict = {
    "name": "Alice",
    "age": 30,
    "city": "New York"
}

# Accessing dictionary values
name = my_dict["name"]  # Access value by key
age = my_dict.get("age")  # Access value using get method

# Modifying dictionary
my_dict["city"] = "San Francisco"  # Update value
my_dict["gender"] = "Female"  # Add a new key-value pair

# Dictionary functions
keys = my_dict.keys()  # Get dictionary keys
values = my_dict.values()  # Get dictionary values
items = my_dict.items()  # Get key-value pairs as tuples

# Checking if a key exists in a dictionary
if "age" in my_dict:
    print("Age exists in the dictionary")

# Removing a key-value pair
removed_value = my_dict.pop("age")

# Dictionary comprehension
squared_numbers = {x: x**2 for x in range(1, 6)}

# Clearing a dictionary
my_dict.clear()

# Printing the results
print("Name:", name)
print("Age:", age)
print("Updated Dictionary:", my_dict)
print("Keys:", keys)
print("Values:", values)
print("Items:", items)
print("Removed Value:", removed_value)
print("Squared Numbers Dictionary:", squared_numbers)

Age exists in the dictionary
Name: Alice
Age: 30
Updated Dictionary: {}
Keys: dict_keys([])
Values: dict_values([])
Items: dict_items([])
Removed Value: 30
Squared Numbers Dictionary: {1: 1, 2: 4, 3: 9, 4: 16, 5: 25}

### Pandas

In [124]:
import pandas as pd
import numpy as np
data = [
    ["John", 25, "New York", 60000, "Sales", "2022-03-15"],
    ["Sarah", 30, "Los Angeles", 75000, "Marketing", "2021-11-20"],
    ["Michael", 28, "Chicago", 62000, "Finance", "2022-05-10"],
    ["Emily", 24, "San Francisco", 70000, "Engineering", "2023-01-08"],
    ["David", 35, "Boston", 80000, "HR", "2020-09-14"],
    ["Olivia", 29, "Houston", 65000, "Sales", "2021-02-28"],
    ["Sophia", 26, "Miami", 63000, "Marketing", "2022-08-03"],
    ["Daniel", 32, "Dallas", 72000, "Finance", "2023-04-22"],
    ["Ava",np.nan, "Seattle", 68000, "Engineering", "2020-06-07"],
    ["David", 35, "Boston", 80000,np.nan, "2020-09-14"],
    ["Ethan", 31, "Atlanta", 71000, "HR", "2022-12-19"],
    ["Liam", 33, "Denver", 78000, "Sales", "2021-07-11"],
    ["Mia", 23, "Phoenix", 59000, "Marketing", "2023-02-14"],
    ["Noah", 34, "Minneapolis", 82000, "Finance", "2020-10-05"],
    ["David", 35, "Boston", 80000, "HR", "2020-09-14"],
    ["Charlotte", 28, "San Diego", 66000, "Engineering", "2022-06-29"],
    ["William", 29, "Portland", 69000, "HR", "2021-09-03"],
    ["Harper", 27,np.nan, 64000, "Sales", "2023-03-08"],
    ["Benjamin", 35, "Austin", 76000, "Marketing", "2020-12-17"],
    ["Sofia", 30, "Orlando", 67000, "Finance", "2021-04-26"],
    ["Michael", 28, "Chicago", 62000, "Finance", "2022-05-10"],
    ["James", 26, "Tampa",np.nan, "Engineering", "2022-10-30"],
    ["Lily", 32, "Charlotte", 73000, "HR", "2023-05-18"],
]

columns = ["Name", "Age", "City", "Salary", "Department", "Hire_Date"]

df = pd.DataFrame(data, columns=columns)
df

         Name   Age           City   Salary   Department   Hire_Date
0        John  25.0       New York  60000.0        Sales  2022-03-15
1       Sarah  30.0    Los Angeles  75000.0    Marketing  2021-11-20
2     Michael  28.0        Chicago  62000.0      Finance  2022-05-10
3       Emily  24.0  San Francisco  70000.0  Engineering  2023-01-08
4       David  35.0         Boston  80000.0           HR  2020-09-14
5      Olivia  29.0        Houston  65000.0        Sales  2021-02-28
6      Sophia  26.0          Miami  63000.0    Marketing  2022-08-03
7      Daniel  32.0         Dallas  72000.0      Finance  2023-04-22
8         Ava   NaN        Seattle  68000.0  Engineering  2020-06-07
9       David  35.0         Boston  80000.0          NaN  2020-09-14
10      Ethan  31.0        Atlanta  71000.0           HR  2022-12-19
11       Liam  33.0         Denver  78000.0        Sales  2021-07-11
12        Mia  23.0        Phoenix  59000.0    Marketing  2023-02-14
13       Noah  34.0    Minneapolis  82000.0      Finance  2020-10-05
14      David  35.0         Boston  80000.0           HR  2020-09-14
15  Charlotte  28.0      San Diego  66000.0  Engineering  2022-06-29
16    William  29.0       Portland  69000.0           HR  2021-09-03
17     Harper  27.0            NaN  64000.0        Sales  2023-03-08
18   Benjamin  35.0         Austin  76000.0    Marketing  2020-12-17
19      Sofia  30.0        Orlando  67000.0      Finance  2021-04-26
20    Michael  28.0        Chicago  62000.0      Finance  2022-05-10
21      James  26.0          Tampa      NaN  Engineering  2022-10-30
22       Lily  32.0      Charlotte  73000.0           HR  2023-05-18

In [125]:
df.head()

      Name   Age           City   Salary   Department   Hire_Date
0     John  25.0       New York  60000.0        Sales  2022-03-15
1    Sarah  30.0    Los Angeles  75000.0    Marketing  2021-11-20
2  Michael  28.0        Chicago  62000.0      Finance  2022-05-10
3    Emily  24.0  San Francisco  70000.0  Engineering  2023-01-08
4    David  35.0         Boston  80000.0           HR  2020-09-14

In [126]:
df.tail()

        Name   Age       City   Salary   Department   Hire_Date
18  Benjamin  35.0     Austin  76000.0    Marketing  2020-12-17
19     Sofia  30.0    Orlando  67000.0      Finance  2021-04-26
20   Michael  28.0    Chicago  62000.0      Finance  2022-05-10
21     James  26.0      Tampa      NaN  Engineering  2022-10-30
22      Lily  32.0  Charlotte  73000.0           HR  2023-05-18

In [127]:
df.describe()

             Age        Salary
count  22.000000     22.000000
mean   29.772727  70090.909091
std     3.766163   7144.155726
min    23.000000  59000.000000
25%    27.250000  64250.000000
50%    29.500000  69500.000000
75%    32.750000  75750.000000
max    35.000000  82000.000000

In [128]:
df.shape

(23, 6)

In [129]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23 entries, 0 to 22
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        23 non-null     object
 1   Age         22 non-null     float64
 2   City        22 non-null     object
 3   Salary      22 non-null     float64
 4   Department  22 non-null     object
 5   Hire_Date   23 non-null     object
dtypes: float64(2), object(4)
memory usage: 1.2+ KB

In [130]:
df.duplicated().sum()

2

In [131]:
df.drop_duplicates()

         Name   Age           City   Salary   Department   Hire_Date
0        John  25.0       New York  60000.0        Sales  2022-03-15
1       Sarah  30.0    Los Angeles  75000.0    Marketing  2021-11-20
2     Michael  28.0        Chicago  62000.0      Finance  2022-05-10
3       Emily  24.0  San Francisco  70000.0  Engineering  2023-01-08
4       David  35.0         Boston  80000.0           HR  2020-09-14
5      Olivia  29.0        Houston  65000.0        Sales  2021-02-28
6      Sophia  26.0          Miami  63000.0    Marketing  2022-08-03
7      Daniel  32.0         Dallas  72000.0      Finance  2023-04-22
8         Ava   NaN        Seattle  68000.0  Engineering  2020-06-07
9       David  35.0         Boston  80000.0          NaN  2020-09-14
10      Ethan  31.0        Atlanta  71000.0           HR  2022-12-19
11       Liam  33.0         Denver  78000.0        Sales  2021-07-11
12        Mia  23.0        Phoenix  59000.0    Marketing  2023-02-14
13       Noah  34.0    Minneapolis  82000.0      Finance  2020-10-05
15  Charlotte  28.0      San Diego  66000.0  Engineering  2022-06-29
16    William  29.0       Portland  69000.0           HR  2021-09-03
17     Harper  27.0            NaN  64000.0        Sales  2023-03-08
18   Benjamin  35.0         Austin  76000.0    Marketing  2020-12-17
19      Sofia  30.0        Orlando  67000.0      Finance  2021-04-26
21      James  26.0          Tampa      NaN  Engineering  2022-10-30
22       Lily  32.0      Charlotte  73000.0           HR  2023-05-18

In [132]:
df.drop_duplicates(subset=['Name', 'City'])

         Name   Age           City   Salary   Department   Hire_Date
0        John  25.0       New York  60000.0        Sales  2022-03-15
1       Sarah  30.0    Los Angeles  75000.0    Marketing  2021-11-20
2     Michael  28.0        Chicago  62000.0      Finance  2022-05-10
3       Emily  24.0  San Francisco  70000.0  Engineering  2023-01-08
4       David  35.0         Boston  80000.0           HR  2020-09-14
5      Olivia  29.0        Houston  65000.0        Sales  2021-02-28
6      Sophia  26.0          Miami  63000.0    Marketing  2022-08-03
7      Daniel  32.0         Dallas  72000.0      Finance  2023-04-22
8         Ava   NaN        Seattle  68000.0  Engineering  2020-06-07
10      Ethan  31.0        Atlanta  71000.0           HR  2022-12-19
11       Liam  33.0         Denver  78000.0        Sales  2021-07-11
12        Mia  23.0        Phoenix  59000.0    Marketing  2023-02-14
13       Noah  34.0    Minneapolis  82000.0      Finance  2020-10-05
15  Charlotte  28.0      San Diego  66000.0  Engineering  2022-06-29
16    William  29.0       Portland  69000.0           HR  2021-09-03
17     Harper  27.0            NaN  64000.0        Sales  2023-03-08
18   Benjamin  35.0         Austin  76000.0    Marketing  2020-12-17
19      Sofia  30.0        Orlando  67000.0      Finance  2021-04-26
21      James  26.0          Tampa      NaN  Engineering  2022-10-30
22       Lily  32.0      Charlotte  73000.0           HR  2023-05-18

In [133]:
df.isnull().sum()

Name          0
Age           1
City          1
Salary        1
Department    1
Hire_Date     0
dtype: int64

In [134]:
df.dropna()

         Name   Age           City   Salary   Department   Hire_Date
0        John  25.0       New York  60000.0        Sales  2022-03-15
1       Sarah  30.0    Los Angeles  75000.0    Marketing  2021-11-20
2     Michael  28.0        Chicago  62000.0      Finance  2022-05-10
3       Emily  24.0  San Francisco  70000.0  Engineering  2023-01-08
4       David  35.0         Boston  80000.0           HR  2020-09-14
5      Olivia  29.0        Houston  65000.0        Sales  2021-02-28
6      Sophia  26.0          Miami  63000.0    Marketing  2022-08-03
7      Daniel  32.0         Dallas  72000.0      Finance  2023-04-22
10      Ethan  31.0        Atlanta  71000.0           HR  2022-12-19
11       Liam  33.0         Denver  78000.0        Sales  2021-07-11
12        Mia  23.0        Phoenix  59000.0    Marketing  2023-02-14
13       Noah  34.0    Minneapolis  82000.0      Finance  2020-10-05
14      David  35.0         Boston  80000.0           HR  2020-09-14
15  Charlotte  28.0      San Diego  66000.0  Engineering  2022-06-29
16    William  29.0       Portland  69000.0           HR  2021-09-03
18   Benjamin  35.0         Austin  76000.0    Marketing  2020-12-17
19      Sofia  30.0        Orlando  67000.0      Finance  2021-04-26
20    Michael  28.0        Chicago  62000.0      Finance  2022-05-10
22       Lily  32.0      Charlotte  73000.0           HR  2023-05-18

In [135]:
df['Age'].value_counts()

35.0    4
28.0    3
30.0    2
29.0    2
26.0    2
32.0    2
25.0    1
24.0    1
31.0    1
33.0    1
23.0    1
34.0    1
27.0    1
Name: Age, dtype: int64

In [136]:
# ascending=True
df = df.sort_values(by='Salary')
df

         Name   Age           City   Salary   Department   Hire_Date
12        Mia  23.0        Phoenix  59000.0    Marketing  2023-02-14
0        John  25.0       New York  60000.0        Sales  2022-03-15
2     Michael  28.0        Chicago  62000.0      Finance  2022-05-10
20    Michael  28.0        Chicago  62000.0      Finance  2022-05-10
6      Sophia  26.0          Miami  63000.0    Marketing  2022-08-03
17     Harper  27.0            NaN  64000.0        Sales  2023-03-08
5      Olivia  29.0        Houston  65000.0        Sales  2021-02-28
15  Charlotte  28.0      San Diego  66000.0  Engineering  2022-06-29
19      Sofia  30.0        Orlando  67000.0      Finance  2021-04-26
8         Ava   NaN        Seattle  68000.0  Engineering  2020-06-07
16    William  29.0       Portland  69000.0           HR  2021-09-03
3       Emily  24.0  San Francisco  70000.0  Engineering  2023-01-08
10      Ethan  31.0        Atlanta  71000.0           HR  2022-12-19
7      Daniel  32.0         Dallas  72000.0      Finance  2023-04-22
22       Lily  32.0      Charlotte  73000.0           HR  2023-05-18
1       Sarah  30.0    Los Angeles  75000.0    Marketing  2021-11-20
18   Benjamin  35.0         Austin  76000.0    Marketing  2020-12-17
11       Liam  33.0         Denver  78000.0        Sales  2021-07-11
14      David  35.0         Boston  80000.0           HR  2020-09-14
9       David  35.0         Boston  80000.0          NaN  2020-09-14
4       David  35.0         Boston  80000.0           HR  2020-09-14
13       Noah  34.0    Minneapolis  82000.0      Finance  2020-10-05
21      James  26.0          Tampa      NaN  Engineering  2022-10-30

In [137]:
df1 = df.copy() # copy a DataFrame

In [138]:
filtered_df = df[df['Age'] > 30]

In [139]:
filtered_df = df[df['Department'] == 'Engineering']

In [140]:
#select the first 5 rows of the DataFrame:
sliced_df = df[:5]

In [141]:
#select only the "Name" and "Salary" columns for all employees:
sliced_df = df[['Name', 'Salary']]

In [142]:
# Create a sample DataFrame
data1 = {'A': [1, 2, 3, 4, 5],
        'B': [10, 20, 30, 40, 50],
        'C': ['apple', 'banana', 'cherry', 'date', 'elderberry']}

df2 = pd.DataFrame(data1, index=['row1', 'row2', 'row3', 'row4', 'row5'])

# Using loc to select data by labels
# Select a single row by label
row2_data = df2.loc['row2']

# Select multiple rows by labels
rows_2_to_4_data = df2.loc['row2':'row4']

# Select a single column by label
column_A = df2.loc[:, 'A']

# Select multiple columns by labels
columns_A_and_B = df2.loc[:, ['A', 'B']]

# Select specific rows and columns by labels
specific_data = df2.loc[['row1', 'row3'], ['A', 'C']]

# Using iloc to select data by integer positions
# Select the first row
first_row = df2.iloc[0]

# Select rows by integer slice
rows_2_to_4 = df2.iloc[1:4]

# Select a single cell by row and column positions
cell_value = df2.iloc[2, 1]

# Select multiple cells by row and column positions
subset = df2.iloc[[0, 3], [0, 2]]

In [143]:
department_salary = df.groupby("Department")["Salary"].mean()
print(department_salary)

Department
Engineering    68000.0
Finance        69000.0
HR             74600.0
Marketing      68250.0
Sales          66750.0
Name: Salary, dtype: float64

In [144]:
city_employee_count = df.groupby("City")["Name"].count()
print(city_employee_count)

City
Atlanta          1
Austin           1
Boston           3
Charlotte        1
Chicago          2
Dallas           1
Denver           1
Houston          1
Los Angeles      1
Miami            1
Minneapolis      1
New York         1
Orlando          1
Phoenix          1
Portland         1
San Diego        1
San Francisco    1
Seattle          1
Tampa            1
Name: Name, dtype: int64

In [145]:
df['Hire_Year'] = pd.to_datetime(df['Hire_Date']).dt.year  # Extract hire year
average_age_by_hire_year = df.groupby("Hire_Year")["Age"].mean()
print(average_age_by_hire_year)

Hire_Year
2020    34.800000
2021    30.200000
2022    27.428571
2023    27.600000
Name: Age, dtype: float64

In [146]:
oldest_employee_by_department = df.groupby("Department")["Age"].max()
print(oldest_employee_by_department)

Department
Engineering    28.0
Finance        34.0
HR             35.0
Marketing      35.0
Sales          33.0
Name: Age, dtype: float64

In [147]:
# Create a pivot table to show average salary and average age by department
pivot_table = df.pivot_table(index='Department', values=['Salary', 'Age'], aggfunc={'Salary': 'mean', 'Age': 'mean'})
print(pivot_table)

              Age   Salary
Department
Engineering  26.0  68000.0
Finance      30.4  69000.0
HR           32.4  74600.0
Marketing    28.5  68250.0
Sales        28.5  66750.0

In [148]:
# Create a pivot table to show the maximum and minimum salary by department
pivot_table = df.pivot_table(index='Department', values='Salary', aggfunc={'Salary': ['max', 'min']})
print(pivot_table)

                 max      min
Department
Engineering  70000.0  66000.0
Finance      82000.0  62000.0
HR           80000.0  69000.0
Marketing    76000.0  59000.0
Sales        78000.0  60000.0

In [149]:
import pandas as pd

# Your existing employee data
data = [
    ["John", 25, "New York", 60000, "Sales", "2022-03-15"],
    ["Sarah", 30, "Los Angeles", 75000, "Marketing", "2021-11-20"],
    ["Michael", 28, "Chicago", 62000, "Finance", "2022-05-10"],
    ["Emily", 24, "San Francisco", 70000, "Engineering", "2023-01-08"],
]

columns = ["Name", "Age", "City", "Salary", "Department", "Hire_Date"]

df = pd.DataFrame(data, columns=columns)

# Sample department data with some non-matching departments
department_data = pd.DataFrame({
    "Department": ["Sales", "Marketing", "HR", "Operations"],
    "Manager": ["Manager A", "Manager B", "Manager C", "Manager D"],
    "Location": ["Location 1", "Location 2", "Location 3", "Location 4"]
})

In [150]:
inner_merged = pd.merge(df, department_data, on="Department", how="inner")
print("Inner Join:")
print(inner_merged)

Inner Join:
    Name  Age         City  Salary Department   Hire_Date    Manager  \
0   John   25     New York   60000      Sales  2022-03-15  Manager A
1  Sarah   30  Los Angeles   75000  Marketing  2021-11-20  Manager B

     Location
0  Location 1
1  Location 2

In [151]:
outer_merged = pd.merge(df, department_data, on="Department", how="outer")
print("\nOuter Join:")
print(outer_merged)

Outer Join:
      Name   Age           City   Salary   Department   Hire_Date    Manager  \
0     John  25.0       New York  60000.0        Sales  2022-03-15  Manager A
1    Sarah  30.0    Los Angeles  75000.0    Marketing  2021-11-20  Manager B
2  Michael  28.0        Chicago  62000.0      Finance  2022-05-10        NaN
3    Emily  24.0  San Francisco  70000.0  Engineering  2023-01-08        NaN
4      NaN   NaN            NaN      NaN           HR         NaN  Manager C
5      NaN   NaN            NaN      NaN   Operations         NaN  Manager D

     Location
0  Location 1
1  Location 2
2         NaN
3         NaN
4  Location 3
5  Location 4

In [152]:
left_merged = pd.merge(df, department_data, on="Department", how="left")
print("\nLeft Join:")
print(left_merged)

Left Join:
      Name  Age           City  Salary   Department   Hire_Date    Manager  \
0     John   25       New York   60000        Sales  2022-03-15  Manager A
1    Sarah   30    Los Angeles   75000    Marketing  2021-11-20  Manager B
2  Michael   28        Chicago   62000      Finance  2022-05-10        NaN
3    Emily   24  San Francisco   70000  Engineering  2023-01-08        NaN

     Location
0  Location 1
1  Location 2
2         NaN
3         NaN

In [153]:
right_merged = pd.merge(df, department_data, on="Department", how="right")
print("\nRight Join:")
print(right_merged)

Right Join:
    Name   Age         City   Salary  Department   Hire_Date    Manager  \
0   John  25.0     New York  60000.0       Sales  2022-03-15  Manager A
1  Sarah  30.0  Los Angeles  75000.0   Marketing  2021-11-20  Manager B
2    NaN   NaN          NaN      NaN          HR         NaN  Manager C
3    NaN   NaN          NaN      NaN  Operations         NaN  Manager D

     Location
0  Location 1
1  Location 2
2  Location 3
3  Location 4

In [154]:
import pandas as pd

# Sample data for df1
data1 = {
    'A': ['A0', 'A1', 'A2'],
    'B': ['B0', 'B1', 'B2'],
}

df1 = pd.DataFrame(data1)

# Sample data for df2
data2 = {
    'A': ['A3', 'A4', 'A5'],
    'B': ['B3', 'B4', 'B5'],
}

df2 = pd.DataFrame(data2)

In [155]:
# Concatenate df1 and df2 along rows (vertically)
concatenated_rows = pd.concat([df1, df2], axis=0)
print("Concatenated Rows (Vertical Concatenation):")
print(concatenated_rows)

Concatenated Rows (Vertical Concatenation):
    A   B
0  A0  B0
1  A1  B1
2  A2  B2
0  A3  B3
1  A4  B4
2  A5  B5

In [156]:
# Concatenate df1 and df2 along columns (horizontally)
concatenated_columns = pd.concat([df1, df2], axis=1)
print("\nConcatenated Columns (Horizontal Concatenation):")
print(concatenated_columns)

Concatenated Columns (Horizontal Concatenation):
    A   B   A   B
0  A0  B0  A3  B3
1  A1  B1  A4  B4
2  A2  B2  A5  B5

In [157]:
data = {
    'A': [1, 2, np.nan, 4, 5],
    'B': [np.nan, 2, 3, 4, 5],
    'C': [1, 2, 3, 4, 5]
}

df = pd.DataFrame(data)

In [158]:
# Fill missing values with the mean of each column
df_filled_mean = df.fillna(df.mean())
print("DataFrame after Filling Missing Values with Mean:")
print(df_filled_mean)

DataFrame after Filling Missing Values with Mean:
     A    B  C
0  1.0  3.5  1
1  2.0  2.0  2
2  3.0  3.0  3
3  4.0  4.0  4
4  5.0  5.0  5

In [159]:
# Fill missing values with the last observation (backward fill)
df_filled_last_observation = df.fillna(method='bfill')
print("\nDataFrame after Filling Missing Values with the Last Observation:")
print(df_filled_last_observation)

DataFrame after Filling Missing Values with the Last Observation:
     A    B  C
0  1.0  2.0  1
1  2.0  2.0  2
2  4.0  3.0  3
3  4.0  4.0  4
4  5.0  5.0  5

In [160]:
# Fill missing values with the most frequent observation (mode)
df_filled_most_frequent = df.fillna(df.mode().iloc[0])
print("\nDataFrame after Filling Missing Values with the Most Frequent Observation:")
print(df_filled_most_frequent)

DataFrame after Filling Missing Values with the Most Frequent Observation:
     A    B  C
0  1.0  2.0  1
1  2.0  2.0  2
2  1.0  3.0  3
3  4.0  4.0  4
4  5.0  5.0  5